#собственно калькулятор, хехе
print('\
░░░░█▐▄▒▒▒▌▌▒▒▌░▌▒▐▐▐▒▒▐▒▒▌▒▀▄▀▄░ \n\
░░░█▐▒▒▀▀▌░▀▀▀░░▀▀▀░░▀▀▄▌▌▐▒▒▒▌▐░ \n\
░░▐▒▒▀▀▄▐░▀▀▄▄░░░░░░░░░░░▐▒▌▒▒▐░▌ \n\
░░▐▒▌▒▒▒▌░▄▄▄▄█▄░░░░░░░▄▄▄▐▐▄▄▀░░ \n\
░░▌▐▒▒▒▐░░░░░░░░░░░░░▀█▄░░░░▌▌░░░ \n\
▄▀▒▒▌▒▒▐░░░░░░░▄░░▄░░░░░▀▀░░▌▌░░░ \n\
▄▄▀▒▐▒▒▐░░░░░░░▐▀▀▀▄▄▀░░░░░░▌▌░░░ \n\
░░░░█▌▒▒▌░░░░░▐▒▒▒▒▒▌░░░░░░▐▐▒▀▀▄ \n\
░░▄▀▒▒▒▒▐░░░░░▐▒▒▒▒▐░░░░░▄█▄▒▐▒▒▒ \n\
▄▀▒▒▒▒▒▄██▀▄▄░░▀▄▄▀░░▄▄▀█▄░█▀▒▒▒▒ \n\
DIANA                  CALCULATOR \n\
')

try: 
	a = input('Введите первое число ')
	a = int(a)
	b = input('Введите второе число ')
	b = int(b)
	c = input('Введите один из операторов: \n+, -, /, *  ')
	if c == '+':
		print('Ответ: {}'.format(a + b))
	elif c == '-':
		print('Ответ: {}'.format(a - b))
	elif c == '*':
		print('Ответ: {}'.format(a * b))
	elif c == '/':
		print('Ответ: {}'.format(a // b))
	else:
		print('хех, нет такого оператора')
except ValueError:
	print('ДУРАК, ТОЛЬКО ЧИСЛА!!!')

